# language: ru

Функционал: Покупка телефона

  Структура сценария: Покупка телефона
    Дано Пользователь "admin" "admin" авторизован
    Когда Пользователь выбирает телефон "<телефон>"
    Тогда Пользователь находится на странице телефона "<телефон>"
    Когда Пользователь нажимает на кнопку "Add to cart"
    И Пользователь переходит в корзину
    То В корзине только телефон "<телефон>"
    Когда Пользователь нажимает на кнопку "Checkout"
    И Пользователь нажимает на кнопку "Confirm"
    Тогда Отображается текст об успешном оформлении заказа

    Примеры:
      | телефон        |
      | HTC U11        |
      | Apple iPhone X |
